src/cf/DataProcessors/ОбработкиНалоговИОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОбработкиНалоговИОтчетности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ОбработкиНалоговИОтчетности/Forms/Форма4ФСС/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ШиринаКнопкиОтправить;

&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

#КонецОбласти



///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		Иначе
			Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Организация = Справочники.Организации.ПредопределеннаяОрганизация();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СобытиеКалендаря) Тогда
		Объект.СобытиеКалендаря = Параметры.СобытиеКалендаря;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеСобытия) Тогда
		Если ЗначениеЗаполнено(Параметры.СостояниеСобытия) Тогда
			Объект.СостояниеСобытия = Параметры.СостояниеСобытия;
		Иначе
			Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
				Объект.Организация,
				Объект.СобытиеКалендаря);
			
		КонецЕсли;
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ДокументОтчетности) Тогда
		Если ЗначениеЗаполнено(Параметры.ДокументОтчетности) Тогда
			ДокументОтчетности = Параметры.ДокументОтчетности;
		Иначе
			ДокументОтчетности = РегламентированнаяОтчетностьУСН.ПолучитьДокументРегламентированнойОтчетностиПоСобытиюКалендаря(Объект.Организация, Объект.СобытиеКалендаря);
		КонецЕсли;
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		ТекущийСпособСдачи = 1;
	Иначе
		Элементы.ОтправитьОтчетностьЧерезИнтернетВыбор.Видимость = Ложь;
	    Элементы.ОтправитьОтчетностьЧерезИнтернетВыбор1.Видимость = Ложь;	
		ТекущийСпособСдачи = 2;
	КонецЕсли;
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
	// Обработка ситуации, если статус отправки "отправлен", то проверяем, нет ли каких-нибудь изменений
	Если Объект.СостояниеСобытия = Перечисления.СостоянияСобытийКалендаря.ПолучитьПодтверждение Тогда
		
		РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
		
		Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
				Объект.Организация,
				Объект.СобытиеКалендаря);
	КонецЕсли;
	
	Заголовок = Объект.СобытиеКалендаря.Наименование;
	
	ИспользуетсяДКО = Истина;
	
	Если РаботаВМоделиСервиса.ЭтоДемонстрационнаяИнформационнаяБаза() Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (в демо не доступно)'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь
	Иначе	
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
	ДатыСобытия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СобытиеКалендаря, "ДатаНачалаДокументов,ДатаОкончанияДокументов");
	ПериодСобытия = ДатыСобытия.ДатаНачалаДокументов;
	СдаетсяЕФС1 = Ложь;
	
	ПериодЗадачиПредставление = ПредставлениеПериода(
		ДатыСобытия.ДатаНачалаДокументов,
		КонецДня(ДатыСобытия.ДатаОкончанияДокументов),
		"ФП=Истина");
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументОтчетности,
			"ДатаНачала,ДатаОкончания,ВыбраннаяФорма");
			
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма, "ФСС");
	
		ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";   
	
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Задача подготовки и сдачи отчета по форме ЕФС-1, раздел 2 выполнена успешно.. 
	|При необходимости ее можно найти в архиве (Календарь налогов и отчетности - группа ""Архив"").
	|Отчет по форме ЕФС-1, раздел 2 рассчитывается и предоставляется один раз в квартал, не позднее 25-го числа, следующего за отчетным.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет по форме ЕФС-1, раздел 2 отправлен по электронным каналам связи. 
	|СФР теперь должен его проверить.
	|Если будут выявлены ошибки, в календаре налогов и отчетности появится соответствующее уведомление.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Проверить наличие подтверждения'");
	Действие.ИмяКоманды = "ОбновитьСтатус";
	Действие.Обработчик = "ОбновитьСтатус";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'История обмена'");
	Действие.ИмяКоманды = "ИсторияОбмена";
	Действие.Обработчик = "ИсторияОбмена";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОжидатьПодтверждения.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет по форме ЕФС-1, раздел 2 не принят. Причины ошибок представлены ниже. Исправьте указанные ошибки и попробуйте отправить отчет заново.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок; 
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Причины отказа, ошибки, комментарии'");
	Действие.ИмяКоманды = "ОшибкиСдачи";
	Действие.Обработчик = "ОшибкиСдачи";
	ПараметрыВажногоСообщения.ПараметрыДействия = Действие;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОзнакомится.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет по форме ЕФС-1, раздел 2 успешно принят в СФР. Для завершения задачи нажмите кнопку ""Готово"".'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена1.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Для отправки отчетности онлайн необходимо заполнить заявление на подключение к 1С-Отчетности.'");
	ПараметрыВажногоСообщения.КраткоеПредставление = "Отсутствует заявление на подключение к 1С-Отчетности";
	ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения(); 
	ПараметрыДействия.ИмяКоманды = "ОформитьЗаявку";
	ПараметрыДействия.Обработчик = "ОформитьЗаявку";
	ПараметрыДействия.Заголовок  = "Подключить 1С-Отчетность";
	ПараметрыВажногоСообщения.ПараметрыДействия = ПараметрыДействия;
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерПодключитьОтчетнность.Имя);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюЗакладку(ЭтаФорма, Объект);

	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПослеПолученияКонтекста", ЭтаФорма);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения); 
	
	УправлениеКоманднойПанелиФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрикрепленаДоверенность" И Параметр = Объект.Организация Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Идет проверка доверенности'");    
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Идет проверка доверенности'");
	ИначеЕсли ИмяСобытия = "ИзмененаЗаявкаЭДО" Тогда
		Если Параметр.Организация = Объект.Организация Тогда
			Если Параметр.ЕстьАктуальнаяЗаявка Тогда
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");       
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'"); 
				Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
			Иначе
				Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");     
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'"); 			
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаТекущаяОрганизация" Тогда
		Если Окно.Основное Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("e1cib/navigationpoint/НалогиИОтчетность");
		Иначе
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменениеСостоянияСобытияКалендаря" Тогда
		Если Параметр = Объект.СобытиеКалендаря
				И Источник <> ЭтаФорма
				И Окно<> Неопределено
				И Не Окно.Основное Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Завершение автообмена с сервером ФСС" Тогда
		Если ЗначениеЗаполнено(Источник) Тогда
			ОтправитьОтчетностьНаСервере();
			УстановитьТекущуюЗакладку(ЭтаФорма,Объект);
			УстановитьЗаголовокФормыПоТекущейСтранице();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СозданоЗаявлениеНаПодключениеКЭДОСКО" Тогда
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтправитьОтчетностьЧерезИнтернетВыбор(Команда)
	
	Если ТекущийСпособСдачи = 2 Тогда
		ПереключитьСпособСдачи(1);
	Иначе
		ШиринаКнопкиОтправить = 5;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.1, Истина);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьОтчетностьСамостоятельно(Команда)
	
	Если ТекущийСпособСдачи = 1 Тогда
		ПереключитьСпособСдачи(2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлВыгрузки(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.СохранитьФайлВыгрузкиОтчетности(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьДекларацию(Команда)
	
	ПараметрыФормыДокумента = ПолучитьДанныеОткрытияФормыФСС(ДокументОтчетности);
	ПараметрыФормы = Новый Структура(
	"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок",
	ПараметрыФормыДокумента.ДатаНачала,
	ПараметрыФормыДокумента.ДатаОкончания,
	ПараметрыФормыДокумента.Периодичность,
	Объект.Организация,
	ПараметрыФормыДокумента.ВыбраннаяФорма,
	ДокументОтчетности);
	
	Если ПериодСобытия >= РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП() Тогда
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетЕФС1ОСС.Форма."+ПараметрыФормыДокумента.ВыбраннаяФорма, ПараметрыФормы);		
	Иначе
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчет4ФСС.Форма."+ПараметрыФормыДокумента.ВыбраннаяФорма, ПараметрыФормы);
	КонецЕсли;
	Форма.Печать("ПоказатьБланк");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОткрытияФормыФСС(ДокументОтчетности)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументОтчетности,
			"ДатаНачала,ДатаОкончания,Периодичность,ВыбраннаяФорма");
	
КонецФункции

&НаКлиенте
Процедура ОшибкиСдачи(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПоказатьПротоколОтправки(ДокументОтчетности, "ФСС");
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОжиданиеЗапросаЗавершение", ЭтаФорма);
	
	КонтекстЭДОКлиент.ОбновитьРезультатОтправленногоОтчетаФСС(ЭтаФорма, ОписаниеОповещения);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеЗапросаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	БылаПопыткаПолученияРезультатаОтСервераФСС = Результат.БылаПопыткаПолученияРезультатаОтСервераФСС;
	ПолученРезультатОтСервераФСС = Результат.ПолученРезультатОтСервераФСС;
	
	Если БылаПопыткаПолученияРезультатаОтСервераФСС И ПолученРезультатОтСервераФСС Тогда
		ПроверитьСтатусОтчета();
	КонецЕсли; 
	
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусОтчета()
	
	РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
	
	Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря);
	
	УстановитьТекущуюЗакладку(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбмена(Команда)
	ПоказатьЗначение(,ПолучитьЦиклОбмена(ДокументОтчетности));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦиклОбмена(Док) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦиклыОбмена.Ссылка
	|ИЗ
	|	Справочник.ЦиклыОбмена КАК ЦиклыОбмена
	|ГДЕ
	|	ЦиклыОбмена.Предмет = &ДокРО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦиклыОбмена.ДатаСоздания УБЫВ");
	Запрос.УстановитьПараметр("ДокРО", Док);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции




// -----------------------------------------------------------------------------
// События переходов

&НаКлиенте
Процедура ПереходЗаполнение(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Заполнить");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		"");
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Объект.Организация,Объект.СобытиеКалендаря);
	
	КалендарьОтчетностиКлиентУНФ.ОткрытьФормуНачалаЗаполнения(ЭтаФорма,ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходДекларацияПоУСН(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить");
	
	ЗафиксироватьПереходкОтправке(Объект.Организация, Объект.СобытиеКалендаря, Объект.СостояниеСобытия);
		
	ДатаСменыСостояния = ТекущаяДата();
	
	УстановитьТекущуюЗакладку(ЭтаФорма,Объект);
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	УстановитьЗаголовокФормыПоТекущейСтранице();
	УправлениеКоманднойПанелиФормы();
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьПереходкОтправке(Организация, Событие, Состояние)
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Организация,
		Событие,
		Состояние,
		"");
	
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, Событие);
	Если ЗаписьКалендаря <> Неопределено Тогда
		ОбъектЗаписьКалендаря = ЗаписьКалендаря.ПолучитьОбъект();
		ОбъектЗаписьКалендаря.Завершено = Ложь;
		ОбъектЗаписьКалендаря.Записать();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереходВыполнил(Команда)
	
	оп = Новый ОписаниеОповещения("ОповещениеПодтверждениеПриема", ЭтотОбъект);
	
	Если СдаетсяЕФС1 Тогда
		ПоказатьВопрос(оп, НСтр("ru='СФР принял декларацию?'"), РежимДиалогаВопрос.ДаНет);  
	Иначе
		ПоказатьВопрос(оп, НСтр("ru='ФСС принял декларацию?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПодтверждениеПриема(Ответ,Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");

	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		"");
	
	ДатаСменыСостояния = ТекущаяДата();	
	
	УстановитьТекущуюЗакладку(ЭтаФорма,Объект);
	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДекларацию(Команда)
	
	ПоказатьЗначение(,ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетность(Команда)
	
	Если ИспользуетсяДКО Тогда
		КонтекстЭДОКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрганДляФСС(ЭтаФорма,Истина, ДокументОтчетности, Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаявлениеОтправленоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОбновитьСтатус" Тогда
		оп = Новый ОписаниеОповещения("ОбновлениеСтатусаЗавершение", ЭтаФорма);
		КонтекстЭДОКлиент.ОбновитьСтатусыЗаявленийАбонентов_ИзФормыСписка(, ЭтаФорма.УникальныйИдентификатор, оп,Объект.Организация);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиКСпискуЗаявлений" Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуСпискаЗаявленийНаПодключение(Объект.Организация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтатусаЗавершение(Результат, ДопПараметры) Экспорт
	ПроверитьВозможностьОтправки();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");

	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		"");
	
	ДатаСменыСостояния = ТекущаяДата();	
	
	УстановитьТекущуюЗакладку(ЭтаФорма,Объект);
	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
КонецПроцедуры

// Конец событий переходов
// -----------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПроверитьВозможностьОтправки()
	
	Если НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "УчетнаяЗаписьОбмена")) Тогда
		// Возможно заявление отправлено, но еще не одобрено
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеАбонентаСпецоператораСвязи.Ссылка
		|ИЗ
		|	Документ.ЗаявлениеАбонентаСпецоператораСвязи КАК ЗаявлениеАбонентаСпецоператораСвязи
		|ГДЕ
		|	НЕ ЗаявлениеАбонентаСпецоператораСвязи.ПометкаУдаления
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Организация = &Организация
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено)";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Если Запрос.Выполнить().Пустой() Тогда
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
		Иначе
			
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
		Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
		Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетностьНаСервере()
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		ДокументОтчетности);
		
	ДатаСменыСостояния = ТекущаяДатаСеанса();
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормыПоТекущейСтранице()
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	РегламентированнаяОтчетностьУСНКлиентСервер.УстановитьЗаголовокФормыЗадачи(ЭтаФорма, Объект.Организация);
	УправлениеКоманднойПанелиФормы();   
	
КонецПроцедуры


&НаКлиенте
Процедура АнимацияОтправить()
	
	Если ШиринаКнопкиОтправить <= 25 Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Ширина = ШиринаКнопкиОтправить;         
		Элементы.ОтправитьВКонтролирующийОрган.Ширина = ШиринаКнопкиОтправить;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.2, Истина);
		ШиринаКнопкиОтправить = ШиринаКнопкиОтправить + 5;
	КонецЕсли;
	
КонецПроцедуры


// 1 - через представителя; 2 - самостоятельно
&НаСервере
Процедура ПереключитьСпособСдачи(СпособСдачи)
	
	Если НЕ РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		СпособСдачи = 2;
	КонецЕсли;
	
	Если СпособСдачи = 1 Тогда 
		Элементы.ПереходВыполнил.Видимость = Ложь;   
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;


		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Истина;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Ложь;
	Иначе
	    Элементы.ПереходВыполнил.Видимость = Истина;    
		Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;      
		Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;

		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Ложь;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущийСпособСдачи = СпособСдачи Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСпособСдачи = СпособСдачи;	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
//// ФУНКЦИИ ДЛЯ РАБОТЫ С ЭДО

&НаКлиенте
Процедура ОформитьЗаявку(Команда)
	 
	ОткрытьФорму("Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.МастерФормированияЗаявкиНаПодключениеУпрощенное",
		Новый Структура("Организация", Объект.Организация),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюЗакладку(ЭтаФорма, Объект)
	
	Если Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ОтчетНеСдан") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОзнакомитьсяЕФС_1;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Распечатать")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Ознакомиться") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ОтчетЕФС_1;
		Если НЕ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить") Тогда
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Иначе
		ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;
	    КонецЕсли;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь; 
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершить") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаПроверенаЕФС_1;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Главная;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено") Тогда
        ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаВыполненаЕФС_1;
	  
		ЭтаФорма.Элементы.Закрыть.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.Закрыть.Важность = ВажностьКнопки.Главная;
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОжидатьПодтвержденияЕФС_1;
		
	Иначе
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ОтчетЕФС_1;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		
	КонецЕсли;

	
КонецПроцедуры
	
#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФСС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма, "ФСС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФСС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФСС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФСС");
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСпособСдачиПриИзменении(Элемент)
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УправлениеКоманднойПанелиФормы()	
	
	ИмяСтраницы = Элементы.СтраницаДекларация.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "ОтчетЕФС_1" Тогда
		Элементы.НавигацияНачало.Видимость = Истина;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаВыполненаЕФС_1" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Истина;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
		
		Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		Элементы.Закрыть.Важность = ВажностьКнопки.Главная;
		
	ИначеЕсли ИмяСтраницы = "ЗадачаОзнакомитьсяЕФС_1" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Истина;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаПроверенаЕФС_1" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Истина;		
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
		Элементы.Далее.Важность = ВажностьКнопки.Главная;

	Иначе
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
